iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХТарифыРазмещения/УБХТарифыРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБХТарифыРазмещения</name>
  <attributes>
    <name>ВидТарифа</name>
    <type>
      <types>EnumRef.УБХВидыТарифовРазмещения</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентскаяГруппа</name>
    <type>
      <types>CatalogRef.УБХКлиентскиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.УБХПроектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпециальногоТарифа</name>
    <type>
      <types>EnumRef.УБХСтатусыСпециальныхТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогУчетаРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаРасширенногоОбъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьШтырьевоАнтены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаМодуль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаСтойку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьКонтейнера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьТермошкафа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонструкцииАМС</name>
    <type>
      <types>EnumRef.УБХТипыКонструкцийАМС</types>
    </type>
  </attributes>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/УБХВидыТарифовРазмещения/УБХВидыТарифовРазмещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБХВидыТарифовРазмещения</name>
  <enumValues>
    <name>Специальный</name>
  </enumValues>
  <enumValues>
    <name>Стандартный</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХТарифыРазмещения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПорогиВысотРазмещения, "Тариф", Объект.Ссылка);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	КэшВидаТариф = Объект.ВидТарифа;
	ПодготовитьФормуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("КэшВидаТариф", КэшВидаТариф);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидТарифаПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	ЭтоСпецТариф = Форма.Объект.ВидТарифа = ПредопределенноеЗначение("Перечисление.УБХВидыТарифовРазмещения.Специальный");
	
	Форма.Элементы.КлиентскаяГруппа.Видимость 			= НЕ ЭтоСпецТариф;
	Форма.Элементы.СтатусСпециальногоТарифа.Видимость 	= ЭтоСпецТариф;
	Форма.Элементы.Проект.Видимость 					= ЭтоСпецТариф;

КонецПроцедуры

#КонецОбласти
